## Reporte de Calidad de Datos

Después de trabajar con múltiples Datasets es conveniente hacer algún reporte de la calidad de nuestros datos.

In [5]:
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

df.mode().transpose()

,0,1,2,3,4,5,6,7,8,9,...,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999
fname,Dolan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
lname,Conley,Harvey,Oconnor,Randall,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
gender,female,male,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,17.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
exercise,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
hours,11.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
grade,100.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
address,"1 Chapel Ave., Cheshire, CT 06410","1 Cottage Street, Rockville, MD 20850","1 Fairview Rd., Ann Arbor, MI 48103","1 Grand Street, Fairburn, GA 30213","1 Grandrose Street, Lakewood, NJ 08701","1 Indian Summer Street, Manchester Township, N...","1 Joy Ridge Dr., Bonita Springs, FL 34135","1 Kirkland Ave., Whitestone, NY 11357","1 Mayfair St., Indiana, PA 15701","1 Nicolls St., Banning, CA 92220",...,"9961 State Ave., Union City, NJ 07087","9973 Miles Court, Worcester, MA 01604","9975 Lookout Court, Buffalo, NY 14215","998 Riverside St., Galloway, OH 43119","999 Nicolls Avenue, Oviedo, FL 32765","999 Sleepy Hollow Lane, Detroit, MI 48205","9991 Parker Court, Lansdowne, PA 19050","9995 Glenholme St., Upper Marlboro, MD 20772","9997 Nicolls St., Bellmore, NY 11710","9999 Longbranch St., Wayne, NJ 07470"

In [6]:
data_types = pd.DataFrame(df.dtypes, columns=['Data Type'])
data_types

         Data Type
fname       object
lname       object
gender      object
age          int64
exercise     int64
hours        int64
grade      float64
address     object

Contando el número de valores extraviados por columna:

In [7]:
missing_data_counts = pd.DataFrame(df.isnull().sum(), columns=['Missing Values'])
missing_data_counts

          Missing Values
fname                  0
lname                  0
gender                 0
age                    0
exercise               0
hours                  0
grade                  0
address                0

In [9]:
df.isnull().sum()

fname       0
lname       0
gender      0
age         0
exercise    0
hours       0
grade       0
address     0
dtype: int64

Contando el total de Observaciones presentes por columna:

In [10]:
present_data_counts = pd.DataFrame(df.count(), columns=['Present Values'])
present_data_counts

          Present Values
fname               2000
lname               2000
gender              2000
age                 2000
exercise            2000
hours               2000
grade               2000
address             2000

In [14]:
df['lname'].count()

2000

Número de observaciones únicas por Columna:

In [19]:
unique_value_counts = pd.DataFrame(columns=['Unique Values'])

for v in list(df.columns.values):
    unique_value_counts.loc[v] = [df[v].nunique()]
unique_value_counts

          Unique Values
fname               958
lname               877
gender                2
age                   6
exercise              6
hours                21
grade               385
address            2000

Valor mínimo en cada columna:

In [20]:
minimum_values = pd.DataFrame(columns=['Minimum Values'])
for v in list(df.columns.values):
    minimum_values.loc[v] = [df[v].min()]
minimum_values

                             Minimum Values
fname                                 Aaron
lname                               Acevedo
gender                               female
age                                      14
exercise                                  0
hours                                     0
grade                                  32.0
address   1 Chapel Ave., Cheshire, CT 06410

Encontrando el valor máximo de cada columna:

In [21]:
maximum_values = pd.DataFrame(columns=['Maximum Values'])
for v in list(df.columns.values):
    maximum_values.loc[v] = [df[v].max()]
maximum_values

                                Maximum Values
fname                                   Zorita
lname                                Zimmerman
gender                                    male
age                                         19
exercise                                     5
hours                                       20
grade                                    100.0
address   9999 Longbranch St., Wayne, NJ 07470

Uniendo todas las lista calculadas en 1 sólo reporte:

In [22]:
pd.concat([present_data_counts, missing_data_counts, unique_value_counts,minimum_values, maximum_values], axis=1)

,Present Values,Missing Values,Unique Values,Minimum Values,Maximum Values
fname,2000,0,958,Aaron,Zorita
lname,2000,0,877,Acevedo,Zimmerman
gender,2000,0,2,female,male
age,2000,0,6,14,19
exercise,2000,0,6,0,5
hours,2000,0,21,0,20
grade,2000,0,385,32.0,100.0
address,2000,0,2000,"1 Chapel Ave., Cheshire, CT 06410","9999 Longbranch St., Wayne, NJ 07470"

## Ej-1 Reporte de calidad de datos

¿Podrías crear un Reporte de calidad de los datos para datasets/tamiami.csv?

In [ ]:
#Ej-1 ....